; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	image1 - mode
	infrared2 - mode
	Star6 - direction
	GroundStation8 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star2 - direction
	Star1 - direction
	Star5 - direction
	Star9 - direction
	Star4 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 image1)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
	(supports instrument3 image1)
	(supports instrument3 image3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star1)
	(supports instrument4 image3)
	(calibration_target instrument4 Star5)
	(supports instrument5 image1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(pointing satellite1 Phenomenon13)
	(have_image Star10 image3)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 spectrograph4)
	(have_image Phenomenon13 spectrograph4)
	(have_image Planet14 spectrograph4)
))

)

; plan
1. (turn_to satellite2 star1 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star1)
   goals met: 0 of 7
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite2 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite2 star10 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star10)
   goals met: 0 of 7
5. (turn_to satellite1 groundstation0 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 7
6. (turn_to satellite0 phenomenon13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 7
7. (take_image satellite2 star10 instrument3 image3)
   added: (have_image star10 image3)
   goals met: 2 of 7
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 7
9. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 2 of 7
10. (turn_to satellite1 phenomenon12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 7
11. (take_image satellite1 phenomenon12 instrument1 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 3 of 7
12. (turn_to satellite1 planet14 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet14)
   goals met: 3 of 7
13. (take_image satellite1 planet14 instrument1 spectrograph4)
   added: (have_image planet14 spectrograph4)
   goals met: 4 of 7
14. (turn_to satellite1 phenomenon13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 phenomenon13)
   goals met: 5 of 7
15. (take_image satellite1 phenomenon13 instrument1 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 6 of 7
16. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 6 of 7
17. (take_image satellite2 star11 instrument3 infrared2)
   added: (have_image star11 infrared2)
   goals met: 7 of 7
